controllers/UserController.php

INSERT INTO `user` (`email`, `password`, `full_name`, `username`, `accessToken`, `authKey`) VALUES ('asdasd@asd.asd22', '$2y$13$ElH/hCAAxTmLKyWp9LMApucHPzhmAjdy7YLZEokabZefpzSL4PtGa', 'asd', 'asd122', 'bab0d5d81f1f973c65d71a22c0b6a3f8', 'efb83d010f2f59470c578be48e892b82')
---
    public function actionCreate()
    {
        $model = new User2();

        if ($model->load(Yii::$app->request->post()) ) {
            $model->accessToken = md5(time() . $model->username);
            $model->authKey = md5( $model->username .time() );
            $model->password = Yii::$app->getSecurity()->generatePasswordHash($model->password);
            if ($model->save()) {